evem-ndm-vmesnik/xml-primeri/soap/getOddanaVlogaRes.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <getOddanaVlogaRes xmlns="http://www.src.si/schemas/evem/ndm/wsdl/20160107"><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
<OddajVlogoReq xmlns="http://www.src.si/schemas/evem/ndm/20160107" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<EvemNDMDocument>
		<Info datumPriprave="2001-12-17T09:30:47.0Z"  oznakaDokumenta="111222333444">
			<Referent email="String" telefon="String" priimek="String"  ime="String"/>
		</Info>
		<Zahtevek><xmlZahtevka><![CDATA[<doc:Document xmlns:doc="http://www.crea.si/Schemas/2004/Document">
	<doc:Data Id="_data0700-44-20151218-000001">
		<doc:DataFormat>
			<doc:Identifier/>
			<doc:MimeType>text/xml</doc:MimeType>
			<doc:Encoding>utf-8</doc:Encoding>
		</doc:DataFormat>
		<doc:Description>Obrazec RefPlac</doc:Description>
		<doc:Content>
			<doc:EmbeddedData>
				<glob:ZahtevekExtended xmlns:glob="http://zzzs.si/b2b/nnz/globalTypes">
					<Zavezanec>		
						<DavcnaStevilka>11111119</DavcnaStevilka>
						<MaticnaStevilka>1111111900</MaticnaStevilka>		
						<Naziv>Podjetje d.o.o</Naziv>
						<IBAN>SI56263300012039086</IBAN>
						<KontaktEmail>ime.priime@test.si</KontaktEmail>
						<KontaktTelefon>0123456789</KontaktTelefon>
					</Zavezanec>
					<Zahtevek>
						<DtZahtevka>2015-12-21+01:00</DtZahtevka>
						<DtIzplacila>2015-12-15+01:00</DtIzplacila>
						<VrstaZahtevka>2</VrstaZahtevka>
						<SifraOeZzzs>210100</SifraOeZzzs>
						<LetoZahtevka>2015</LetoZahtevka>
						<MesecZahtevka>11</MesecZahtevka>
						<FiksniObracun>false</FiksniObracun>
						<StUrSkupno>180.00</StUrSkupno>
						<StObracunov>1</StObracunov>
						<StPrilog>1</StPrilog>
						<ZnZahtevka>406.70</ZnZahtevka>
					</Zahtevek>
					<Obracuni>
						<Obracun Id="1">
							<Zavarovanec>
								<ZzzsStevilka>20000000</ZzzsStevilka>
								<Priimek>Test</Priimek>
								<Ime>Test</Ime>
							</Zavarovanec>
							<DelovniKoledar Sifra="1"/>
							<PosebnostiPrispevkov>
								<Posebnost Sifra="9">
									<Odstotek>0.06</Odstotek>
								</Posebnost>
								<Posebnost Sifra="8">
									<Odstotek>6.56</Odstotek>
								</Posebnost>
								<Posebnost Sifra="24">
									<Odstotek>4.43</Odstotek>
								</Posebnost>
								<Posebnost Sifra="0">
									<Odstotek>0.00</Odstotek>
								</Posebnost>
								<Posebnost Sifra="11">
									<Odstotek>0.53</Odstotek>
								</Posebnost>
								<Posebnost Sifra="10">
									<Odstotek>0.10</Odstotek>
								</Posebnost>
							</PosebnostiPrispevkov>
							<SifraZavarovalnePodlage>1</SifraZavarovalnePodlage>
							<ZnObracuna>406.70</ZnObracuna>
							<ZnPrispMin>0.00</ZnPrispMin>
							<SifraRazlogaZadrzanosti>1</SifraRazlogaZadrzanosti>
							<SifraPizZaBenefikacijo>99</SifraPizZaBenefikacijo>
							<Dt1DanZadrzanosti>2015-04-07+02:00</Dt1DanZadrzanosti>
							<Dt1DanVBremeZzzs>2015-05-19+02:00</Dt1DanVBremeZzzs>
							<DtZadrzanostiOd>2015-11-02+01:00</DtZadrzanostiOd>
							<DtZadrzanostiDo>2015-11-13+01:00</DtZadrzanostiDo>
							<Dt91Dne>2013-09-16+02:00</Dt91Dne>
							<KolicnikValorizacije>1</KolicnikValorizacije>
							<StUrMesObveznosti>168.00</StUrMesObveznosti>
							<StUrZadrzanostiDejansko>80.00</StUrZadrzanostiDejansko>
							<StUrIk>0.00</StUrIk>
							<StUrZk>0.00</StUrZk>
							<OzPolicist>false</OzPolicist>
							<OzZujf>B</OzZujf>
							<OsnovaPreteklegaLeta>
								<LetoOsnove>2012</LetoOsnove>
								<ZnBrutoOsnova>9908.34</ZnBrutoOsnova>
								<MeseciIzplacil>13</MeseciIzplacil>
								<StUrOsnove>1880.00</StUrOsnove>
								<ZnUrnaOsnova>6.04</ZnUrnaOsnova>
							</OsnovaPreteklegaLeta>
							<InformativniIzracun>
								<ZnIzhodiscnaUrnaOsnova>5.27</ZnIzhodiscnaUrnaOsnova>
								<ZnUrnaOsnovaZaNadomestilo>4.74</ZnUrnaOsnovaZaNadomestilo>
								<ZnBruto1Nadomestila>379.20</ZnBruto1Nadomestila>
								<ZnBruto2Nadomestila>406.70</ZnBruto2Nadomestila>
								<ZnPrispevkiZavezanca>27.50</ZnPrispevkiZavezanca>
								<ZnNadomestilaSkupaj>406.70</ZnNadomestilaSkupaj>
								<Prispevki>
									<Prispevek Sifra="9">
										<Odstotek>0.06</Odstotek>
										<Znesek>0.20</Znesek>
									</Prispevek>
									<Prispevek Sifra="8">
										<Odstotek>6.56</Odstotek>
										<Znesek>22.15</Znesek>
									</Prispevek>
									<Prispevek Sifra="24">
										<Odstotek>4.43</Odstotek>
										<Znesek>14.94</Znesek>
									</Prispevek>
									<Prispevek Sifra="0">
										<Odstotek>0.00</Odstotek>
										<Znesek>0.00</Znesek>
									</Prispevek>
									<Prispevek Sifra="11">
										<Odstotek>0.53</Odstotek>
										<Znesek>1.79</Znesek>
									</Prispevek>
									<Prispevek Sifra="10">
										<Odstotek>0.10</Odstotek>
										<Znesek>0.34</Znesek>
									</Prispevek>
								</Prispevki>
							</InformativniIzracun>
							<Dokumenti>
								<Dokument Id="_1" Sifra="731">Opis</Dokument>
								<Dokument Id="_2" Sifra="736">Opis</Dokument>
							</Dokumenti>
						</Obracun>
					</Obracuni>
				</glob:ZahtevekExtended>
			</doc:EmbeddedData>
		</doc:Content>
	</doc:Data>
	<doc:Signatures>
		<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:xds="http://uri.etsi.org/01903/v1.1.1#" Id="Signature-aa5afdab-45b4-4e9b-ab43-113ac3e150dc">
			<ds:SignedInfo>
				<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
				<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
				<!-- referenca na ID  doc:Data Id="_data0700-44-20151218-000001" -->
				<ds:Reference URI="#_data0700-44-20151218-000001">
					<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
					<ds:DigestValue>TFzEjGmTBHfjIlUQNZj3BH4axlQ=</ds:DigestValue>
				</ds:Reference>
			</ds:SignedInfo>
			<ds:SignatureValue Id="SignatureValue-4fdd0b2d-9109-4ae2-8fdb-693d73c21920">kYCedq3FYn3h1fMeTbEN9UPv6wGQRutEqZV7lq5mzuc9ejL4fd2snJZP7+dTU8+lgq71DcHRw6Ng
//0ObGH/X0hcZTrjoXF3ePjRO0ZyxleXhMVYnR3hKhXTxfJhGkpsGAxYVXw+wM0h5N8kO+WdAflZ
cEjaDc3/8jqBCdZQS7m5gDPBMO4vIV4UWnwsjUATx68INlekuitnVAwItlC85d+G//viUXNwVnUP
VeALnIaBNTGMMFEVQzdO0tqKYGvNJoH4qChFRo84ZDSxxWV1epjy5C5juObaYVLwFYkWpXOAhpj3
eYMOG/70xLokGL5qyB3WDzH/iay/UZR0DojXOw==</ds:SignatureValue>
			<ds:KeyInfo>
				<ds:X509Data>
					<ds:X509Certificate><!--BASE64 ENKODIRAN CERTIFIKAT --></ds:X509Certificate>
				</ds:X509Data>
			</ds:KeyInfo>			
		</ds:Signature>
	</doc:Signatures>
</doc:Document>
]]]]><![CDATA[></xmlZahtevka></Zahtevek>
		<Priloga id="_1"><![CDATA[<doc:Document xmlns:doc="http://www.crea.si/Schemas/2004/Document">
	<doc:Attachments>
		<doc:Attachment Id="_1">
			<doc:DataFormat>
				<doc:Identifier/>
				<doc:MimeType>image/tiff</doc:MimeType>
				<doc:Encoding>base64</doc:Encoding>
			</doc:DataFormat>
			<doc:Description>Priloga</doc:Description>
			<doc:Content>
				<doc:EmbeddedData>dGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdA==
</doc:EmbeddedData>
			</doc:Content>
			<doc:FileName>OpticnoPrebranDokument</doc:FileName>
		</doc:Attachment>
	</doc:Attachments>
	<doc:Signatures>
		<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-8e3fe72e-675f-4ad3-8b66-f9b86eb8284f">
			<ds:SignedInfo>
				<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
				<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
				<ds:Reference URI="#_1">
					<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
					<ds:DigestValue>xlQ17nBKNbYuQIdFeIr0fJjZLTg=</ds:DigestValue>
				</ds:Reference>
			</ds:SignedInfo>
			<ds:SignatureValue Id="SignatureValue-9475b578-fdaf-41c3-b6fe-9b41a55abcf6">h4tVTyATLP9y/mafEap4b6S7mPD5Tmm3e0MMDziqMrv7w6C2ltf0RzoxegGUeiYag1zJ8YpnZCVh
DVz0WtekfQsMN6SI950ff30QE0+rs1ky1hOPm4rCTzTFrctRVHG7DGy+5v7tcaSxczvOhS1Qwana
vI6Q1MtqjqpzSoMOYltEXtVzPyWWZjguoo+GUoXsZgE3DhyHeAnVA4s8YRilkVza36+B/lAnRpjW
5q5wWv0AS053OBnxcjHPgyKNuHKywvc/FtvHiFwnTsDa47zFaUMIsikE5QrtJ/l6Fm/B30eZWfAb
1WbI7fT3/7fLL69MDXY27kCTMSwZYF9NSabsIA==</ds:SignatureValue>
			<ds:KeyInfo>
				<ds:X509Data>
<ds:X509Certificate><!--BASE64 ENKODIRAN CERTIFIKAT --></ds:X509Certificate>
				</ds:X509Data>
			</ds:KeyInfo>
		</ds:Signature>
	</doc:Signatures>
</doc:Document>
]]]]><![CDATA[></Priloga>
		<Priloga id="_2"><![CDATA[<doc:Document xmlns:doc="http://www.crea.si/Schemas/2004/Document">
	<doc:Attachments>
		<doc:Attachment Id="_2">
			<doc:DataFormat>
				<doc:Identifier/>
				<doc:MimeType>image/tiff</doc:MimeType>
				<doc:Encoding>base64</doc:Encoding>
			</doc:DataFormat>
			<doc:Description>Priloga</doc:Description>
			<doc:Content>
				<doc:EmbeddedData>dGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdCB0ZXN0IHRlc3QgdGVzdA==
</doc:EmbeddedData>
			</doc:Content>
			<doc:FileName>OpticnoPrebranDokument</doc:FileName>
		</doc:Attachment>
	</doc:Attachments>
	<doc:Signatures>
		<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-8e3fe72e-675f-4ad3-8b66-f9b86eb8284f">
			<ds:SignedInfo>
				<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
				<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
				<ds:Reference URI="#_2">
					<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
					<ds:DigestValue>xlQ17nBKNbYuQIdFeIr0fJjZLTg=</ds:DigestValue>
				</ds:Reference>
			</ds:SignedInfo>
			<ds:SignatureValue Id="SignatureValue-9475b578-fdaf-41c3-b6fe-9b41a55abcf6">h4tVTyATLP9y/mafEap4b6S7mPD5Tmm3e0MMDziqMrv7w6C2ltf0RzoxegGUeiYag1zJ8YpnZCVh
DVz0WtekfQsMN6SI950ff30QE0+rs1ky1hOPm4rCTzTFrctRVHG7DGy+5v7tcaSxczvOhS1Qwana
vI6Q1MtqjqpzSoMOYltEXtVzPyWWZjguoo+GUoXsZgE3DhyHeAnVA4s8YRilkVza36+B/lAnRpjW
5q5wWv0AS053OBnxcjHPgyKNuHKywvc/FtvHiFwnTsDa47zFaUMIsikE5QrtJ/l6Fm/B30eZWfAb
1WbI7fT3/7fLL69MDXY27kCTMSwZYF9NSabsIA==</ds:SignatureValue>
			<ds:KeyInfo>
				<ds:X509Data>
<ds:X509Certificate><!--BASE64 ENKODIRAN CERTIFIKAT --></ds:X509Certificate>
				</ds:X509Data>
			</ds:KeyInfo>
		</ds:Signature>
	</doc:Signatures>
</doc:Document>
]]]]><![CDATA[></Priloga>
</EvemNDMDocument>
</OddajVlogoReq>]]></getOddanaVlogaRes>
   </soapenv:Body>
</soapenv:Envelope>